GopalSaraf/Practicals/PSDL/include/proc/pic18f86j50.inc
#define MSK61                            BANKMASK(SSP1ADD), 6, a
#define MSK62                            BANKMASK(SSP2ADD), 6, a
#define MSK71                            BANKMASK(SSP1ADD), 7, a
#define MSK72                            BANKMASK(SSP2ADD), 7, a
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOT_A                            BANKMASK(SSP1STAT), 5, a
#define NOT_A2                           BANKMASK(SSP2STAT), 5, a
#define NOT_ADDRESS2                     BANKMASK(SSP2STAT), 5, a
#define NOT_BOR                          BANKMASK(RCON), 0, a
#define NOT_CM                           BANKMASK(RCON), 5, a
#define NOT_DONE                         BANKMASK(ADCON0), 1, a
#define NOT_PD                           BANKMASK(RCON), 2, a
#define NOT_POR                          BANKMASK(RCON), 1, a
#define NOT_RBPU                         BANKMASK(INTCON2), 7, a
#define NOT_RI                           BANKMASK(RCON), 4, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_TO                           BANKMASK(RCON), 3, a
#define NOT_W                            BANKMASK(SSP1STAT), 2, a
#define NOT_W2                           BANKMASK(SSP2STAT), 2, a
#define NOT_WRITE2                       BANKMASK(SSP2STAT), 2, a
#define OB0E                             BANKMASK(PMSTATL), 0, b
#define OB1E                             BANKMASK(PMSTATL), 1, b
#define OB2E                             BANKMASK(PMSTATL), 2, b
#define OB3E                             BANKMASK(PMSTATL), 3, b
#define OBE                              BANKMASK(PMSTATL), 7, b
#define OBUF                             BANKMASK(PMSTATL), 6, b
#define OE                               BANKMASK(PORTJ), 1, a
#define OERR                             BANKMASK(RCSTA1), 1, a
#define OERR1                            BANKMASK(RCSTA1), 1, a
#define OERR2                            BANKMASK(RCSTA2), 1, a
#define OSC2                             BANKMASK(PORTA), 6, a
#define OSCFIE                           BANKMASK(PIE2), 7, a
#define OSCFIF                           BANKMASK(PIR2), 7, a
#define OSCFIP                           BANKMASK(IPR2), 7, a
#define OSTS                             BANKMASK(OSCCON), 3, a
#define OV                               BANKMASK(STATUS), 3, a
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define P1DC0                            BANKMASK(ECCP1DEL), 0, a
#define P1DC1                            BANKMASK(ECCP1DEL), 1, a
#define P1DC2                            BANKMASK(ECCP1DEL), 2, a
#define P1DC3                            BANKMASK(ECCP1DEL), 3, a
#define P1DC4                            BANKMASK(ECCP1DEL), 4, a
#define P1DC5                            BANKMASK(ECCP1DEL), 5, a
#define P1DC6                            BANKMASK(ECCP1DEL), 6, a
#define P1M0                             BANKMASK(ECCP1CON), 6, a
#define P1M1                             BANKMASK(ECCP1CON), 7, a
#define P1RSEN                           BANKMASK(ECCP1DEL), 7, a
#define P2                               BANKMASK(SSP2STAT), 4, a
#define P2DC0                            BANKMASK(ECCP2DEL), 0, a
#define P2DC1                            BANKMASK(ECCP2DEL), 1, a
#define P2DC2                            BANKMASK(ECCP2DEL), 2, a
#define P2DC3                            BANKMASK(ECCP2DEL), 3, a
#define P2DC4                            BANKMASK(ECCP2DEL), 4, a
#define P2DC5                            BANKMASK(ECCP2DEL), 5, a
#define P2DC6                            BANKMASK(ECCP2DEL), 6, a
#define P2M0                             BANKMASK(ECCP2CON), 6, a
#define P2M1                             BANKMASK(ECCP2CON), 7, a
#define P2RSEN                           BANKMASK(ECCP2DEL), 7, a
#define P3DC0                            BANKMASK(ECCP3DEL), 0, a
#define P3DC1                            BANKMASK(ECCP3DEL), 1, a
#define P3DC2                            BANKMASK(ECCP3DEL), 2, a
#define P3DC3                            BANKMASK(ECCP3DEL), 3, a
#define P3DC4                            BANKMASK(ECCP3DEL), 4, a
#define P3DC5                            BANKMASK(ECCP3DEL), 5, a
#define P3DC6                            BANKMASK(ECCP3DEL), 6, a
#define P3M0                             BANKMASK(ECCP3CON), 6, a
#define P3M1                             BANKMASK(ECCP3CON), 7, a
#define P3RSEN                           BANKMASK(ECCP3DEL), 7, a
#define PA1                              BANKMASK(PORTC), 2, a
#define PA2                              BANKMASK(PORTC), 1, a
#define PA2E                             BANKMASK(PORTE), 7, a
#define PB1                              BANKMASK(PORTH), 7, a
#define PB1E                             BANKMASK(PORTE), 6, a
#define PB2                              BANKMASK(PORTE), 2, a
#define PB3                              BANKMASK(PORTH), 5, a
#define PB3E                             BANKMASK(PORTE), 4, a
#define PC1                              BANKMASK(PORTH), 6, a
#define PC1E                             BANKMASK(PORTE), 5, a
#define PC2                              BANKMASK(PORTE), 1, a
#define PC3                              BANKMASK(PORTH), 4, a
#define PC3E                             BANKMASK(PORTE), 3, a
#define PCFG0                            BANKMASK(ANCON0), 0, a
#define PCFG1                            BANKMASK(ANCON0), 1, a
#define PCFG10                           BANKMASK(ANCON1), 2, a
#define PCFG11                           BANKMASK(ANCON1), 3, a
#define PCFG12                           BANKMASK(ANCON1), 4, a
#define PCFG13                           BANKMASK(ANCON1), 5, a
#define PCFG14                           BANKMASK(ANCON1), 6, a
#define PCFG15                           BANKMASK(ANCON1), 7, a
#define PCFG2                            BANKMASK(ANCON0), 2, a
#define PCFG3                            BANKMASK(ANCON0), 3, a
#define PCFG4                            BANKMASK(ANCON0), 4, a
#define PCFG5                            BANKMASK(ANCON0), 5, a
#define PCFG6                            BANKMASK(ANCON0), 6, a
#define PCFG7                            BANKMASK(ANCON0), 7, a
#define PCFG8                            BANKMASK(ANCON1), 0, a
#define PCFG9                            BANKMASK(ANCON1), 1, a
#define PD                               BANKMASK(RCON), 2, a
#define PD2                              BANKMASK(PORTE), 0, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PEN                              BANKMASK(SSP1CON2), 2, a
#define PEN1                             BANKMASK(SSP1CON2), 2, a
#define PEN2                             BANKMASK(SSP2CON2), 2, a
#define PGC                              BANKMASK(PORTB), 5, a
#define PGD                              BANKMASK(PORTB), 6, a
#define PIDEE                            BANKMASK(UEIE), 0, b
#define PIDEF                            BANKMASK(UEIR), 0, a
#define PKTDIS                           BANKMASK(UCON), 4, a
#define PLLEN                            BANKMASK(OSCTUNE), 6, a
#define PMA0                             BANKMASK(PORTB), 5, a
#define PMA1                             BANKMASK(PORTB), 4, a
#define PMA10                            BANKMASK(PORTE), 6, a
#define PMA11                            BANKMASK(PORTE), 5, a
#define PMA12                            BANKMASK(PORTE), 4, a
#define PMA13                            BANKMASK(PORTE), 3, a
#define PMA2                             BANKMASK(PORTB), 3, a
#define PMA3                             BANKMASK(PORTB), 2, a
#define PMA4                             BANKMASK(PORTB), 1, a
#define PMA5                             BANKMASK(PORTF), 2, a
#define PMA6                             BANKMASK(PORTG), 2, a
#define PMA7                             BANKMASK(PORTG), 1, a
#define PMA8                             BANKMASK(PORTG), 0, a
#define PMA9                             BANKMASK(PORTE), 7, a
#define PMCS1                            BANKMASK(PORTG), 3, a
#define PMCS2                            BANKMASK(PORTG), 4, a
#define PMPEN                            BANKMASK(PMCONH), 7, b
#define PMPIE                            BANKMASK(PIE1), 7, a
#define PMPIF                            BANKMASK(PIR1), 7, a
#define PMPIP                            BANKMASK(IPR1), 7, a
#define PMPTL                            BANKMASK(PADCFG1), 0, a
#define PMPTTL                           BANKMASK(PADCFG1), 0, a
#define POR                              BANKMASK(RCON), 1, a
#define PPB0                             BANKMASK(UCFG), 0, b
#define PPB1                             BANKMASK(UCFG), 1, b
#define PPBI                             BANKMASK(USTAT), 1, a
#define PPBRST                           BANKMASK(UCON), 6, a
#define PSA                              BANKMASK(T0CON), 3, a
#define PSIDL                            BANKMASK(PMCONH), 5, b
#define PSPIE                            BANKMASK(PIE1), 7, a
#define PSPIF                            BANKMASK(PIR1), 7, a
#define PSPIP                            BANKMASK(IPR1), 7, a
#define PSS1AC0                          BANKMASK(ECCP1AS), 2, a
#define PSS1AC1                          BANKMASK(ECCP1AS), 3, a
#define PSS1BD0                          BANKMASK(ECCP1AS), 0, a
#define PSS1BD1                          BANKMASK(ECCP1AS), 1, a
#define PSS2AC0                          BANKMASK(ECCP2AS), 2, a
#define PSS2AC1                          BANKMASK(ECCP2AS), 3, a
#define PSS2BD0                          BANKMASK(ECCP2AS), 0, a
#define PSS2BD1                          BANKMASK(ECCP2AS), 1, a
#define PSS3AC0                          BANKMASK(ECCP3AS), 2, a
#define PSS3AC1                          BANKMASK(ECCP3AS), 3, a
#define PSS3BD0                          BANKMASK(ECCP3AS), 0, a
#define PSS3BD1                          BANKMASK(ECCP3AS), 1, a
#define PTBEEN                           BANKMASK(PMCONH), 2, b
#define PTEN0                            BANKMASK(PMEL), 0, b
#define PTEN1                            BANKMASK(PMEL), 1, b
#define PTEN10                           BANKMASK(PMEH), 2, b
#define PTEN11                           BANKMASK(PMEH), 3, b
#define PTEN12                           BANKMASK(PMEH), 4, b
#define PTEN13                           BANKMASK(PMEH), 5, b
#define PTEN14                           BANKMASK(PMEH), 6, b
#define PTEN15                           BANKMASK(PMEH), 7, b
#define PTEN2                            BANKMASK(PMEL), 2, b
#define PTEN3                            BANKMASK(PMEL), 3, b
#define PTEN4                            BANKMASK(PMEL), 4, b
#define PTEN5                            BANKMASK(PMEL), 5, b
#define PTEN6                            BANKMASK(PMEL), 6, b
#define PTEN7                            BANKMASK(PMEL), 7, b
#define PTEN8                            BANKMASK(PMEH), 0, b
#define PTEN9                            BANKMASK(PMEH), 1, b
#define PTRDEN                           BANKMASK(PMCONH), 0, b
#define PTWREN                           BANKMASK(PMCONH), 1, b
#define RA0                              BANKMASK(PORTA), 0, a
#define RA1                              BANKMASK(PORTA), 1, a
#define RA2                              BANKMASK(PORTA), 2, a
#define RA3                              BANKMASK(PORTA), 3, a
#define RA4                              BANKMASK(PORTA), 4, a
#define RA5                              BANKMASK(PORTA), 5, a
#define RA6                              BANKMASK(PORTA), 6, a
#define RA7                              BANKMASK(PORTA), 7, a
#define RB0                              BANKMASK(PORTB), 0, a
#define RB1                              BANKMASK(PORTB), 1, a
#define RB2                              BANKMASK(PORTB), 2, a
#define RB3                              BANKMASK(PORTB), 3, a
#define RB4                              BANKMASK(PORTB), 4, a
#define RB5                              BANKMASK(PORTB), 5, a
#define RB6                              BANKMASK(PORTB), 6, a
#define RB7                              BANKMASK(PORTB), 7, a
#define RBIE                             BANKMASK(INTCON), 3, a
#define RBIF                             BANKMASK(INTCON), 0, a
#define RBIP                             BANKMASK(INTCON2), 0, a
#define RBPU                             BANKMASK(INTCON2), 7, a
#define RC0                              BANKMASK(PORTC), 0, a
#define RC1                              BANKMASK(PORTC), 1, a
#define RC1IE                            BANKMASK(PIE1), 5, a
#define RC1IF                            BANKMASK(PIR1), 5, a
#define RC1IP                            BANKMASK(IPR1), 5, a
#define RC2                              BANKMASK(PORTC), 2, a
#define RC2IE                            BANKMASK(PIE3), 5, a
#define RC2IF                            BANKMASK(PIR3), 5, a
#define RC2IP                            BANKMASK(IPR3), 5, a
#define RC3                              BANKMASK(PORTC), 3, a
#define RC4                              BANKMASK(PORTC), 4, a
#define RC5                              BANKMASK(PORTC), 5, a
#define RC6                              BANKMASK(PORTC), 6, a
#define RC7                              BANKMASK(PORTC), 7, a
#define RC8_92                           BANKMASK(RCSTA2), 6, a
#define RC92                             BANKMASK(RCSTA2), 6, a
#define RCD82                            BANKMASK(RCSTA2), 0, a
#define RCEN                             BANKMASK(SSP1CON2), 3, a
#define RCEN1                            BANKMASK(SSP1CON2), 3, a
#define RCEN2                            BANKMASK(SSP2CON2), 3, a
#define RCIDL                            BANKMASK(BAUDCON1), 6, a
#define RCIDL1                           BANKMASK(BAUDCON1), 6, a
#define RCIDL2                           BANKMASK(BAUDCON2), 6, a
#define RCIE                             BANKMASK(PIE1), 5, a
#define RCIF                             BANKMASK(PIR1), 5, a
#define RCIP                             BANKMASK(IPR1), 5, a
#define RCMT1                            BANKMASK(BAUDCON1), 6, a
#define RCMT2                            BANKMASK(BAUDCON2), 6, a
#define RD0                              BANKMASK(PORTD), 0, a
#define RD1                              BANKMASK(PORTD), 1, a
#define RD163                            BANKMASK(T3CON), 7, a
#define RD2                              BANKMASK(PORTD), 2, a
#define RD3                              BANKMASK(PORTD), 3, a
#define RD4                              BANKMASK(PORTD), 4, a
#define RD5                              BANKMASK(PORTD), 5, a
#define RD6                              BANKMASK(PORTD), 6, a
#define RD7                              BANKMASK(PORTD), 7, a
#define RDE                              BANKMASK(PORTE), 0, a
#define RDPU                             BANKMASK(PORTG), 7, a
#define RDSP                             BANKMASK(PMCONL), 0, b
#define RE0                              BANKMASK(PORTE), 0, a
#define RE1                              BANKMASK(PORTE), 1, a
#define RE2                              BANKMASK(PORTE), 2, a
#define RE3                              BANKMASK(PORTE), 3, a
#define RE4                              BANKMASK(PORTE), 4, a
#define RE5                              BANKMASK(PORTE), 5, a
#define RE6                              BANKMASK(PORTE), 6, a
#define RE7                              BANKMASK(PORTE), 7, a
#define READ_WRITE2                      BANKMASK(SSP2STAT), 2, a
#define REFO                             BANKMASK(PORTE), 3, a
#define REGSLP                           BANKMASK(WDTCON), 7, a
#define REPU                             BANKMASK(PORTG), 6, a
#define RESUME                           BANKMASK(UCON), 2, a
#define RF2                              BANKMASK(PORTF), 2, a
#define RF3                              BANKMASK(PORTF), 3, a
#define RF4                              BANKMASK(PORTF), 4, a
#define RF5                              BANKMASK(PORTF), 5, a
#define RF6                              BANKMASK(PORTF), 6, a
#define RF7                              BANKMASK(PORTF), 7, a
#define RG0                              BANKMASK(PORTG), 0, a
#define RG1                              BANKMASK(PORTG), 1, a
#define RG2                              BANKMASK(PORTG), 2, a
#define RG3                              BANKMASK(PORTG), 3, a
#define RG4                              BANKMASK(PORTG), 4, a
#define RG5                              BANKMASK(PORTG), 5, a
#define RG6                              BANKMASK(PORTG), 6, a
#define RG7                              BANKMASK(PORTG), 7, a
#define RH0                              BANKMASK(PORTH), 0, a
#define RH1                              BANKMASK(PORTH), 1, a
#define RH2                              BANKMASK(PORTH), 2, a
#define RH3                              BANKMASK(PORTH), 3, a
#define RH4                              BANKMASK(PORTH), 4, a
#define RH5                              BANKMASK(PORTH), 5, a
#define RH6                              BANKMASK(PORTH), 6, a
#define RH7                              BANKMASK(PORTH), 7, a
#define RI                               BANKMASK(RCON), 4, a
#define RJ0                              BANKMASK(PORTJ), 0, a
#define RJ1                              BANKMASK(PORTJ), 1, a
#define RJ2                              BANKMASK(PORTJ), 2, a
#define RJ3                              BANKMASK(PORTJ), 3, a
#define RJ4                              BANKMASK(PORTJ), 4, a
#define RJ5                              BANKMASK(PORTJ), 5, a
#define RJ6                              BANKMASK(PORTJ), 6, a
#define RJ7                              BANKMASK(PORTJ), 7, a
#define RJPU                             BANKMASK(PORTG), 5, a
#define RODIV0                           BANKMASK(REFOCON), 0, a
#define RODIV1                           BANKMASK(REFOCON), 1, a
#define RODIV2                           BANKMASK(REFOCON), 2, a
#define RODIV3                           BANKMASK(REFOCON), 3, a
#define ROON                             BANKMASK(REFOCON), 7, a
#define ROSEL                            BANKMASK(REFOCON), 4, a
#define ROSSLP                           BANKMASK(REFOCON), 5, a
#define RSEN                             BANKMASK(SSP1CON2), 1, a
#define RSEN1                            BANKMASK(SSP1CON2), 1, a
#define RSEN2                            BANKMASK(SSP2CON2), 1, a
#define RW                               BANKMASK(SSP1STAT), 2, a
#define RW1                              BANKMASK(SSP1STAT), 2, a
#define RW2                              BANKMASK(SSP2STAT), 2, a
#define RX                               BANKMASK(PORTC), 7, a
#define RX2                              BANKMASK(PORTG), 2, a
#define RX9                              BANKMASK(RCSTA1), 6, a
#define RX91                             BANKMASK(RCSTA1), 6, a
#define RX92                             BANKMASK(RCSTA2), 6, a
#define RX9D                             BANKMASK(RCSTA1), 0, a
#define RX9D1                            BANKMASK(RCSTA1), 0, a
#define RX9D2                            BANKMASK(RCSTA2), 0, a
#define RXB0IE                           BANKMASK(PIE3), 0, a
#define RXB1IE                           BANKMASK(PIE3), 1, a
#define RXBNIE                           BANKMASK(PIE3), 1, a
#define RXBNIF                           BANKMASK(PIR3), 1, a
#define RXBNIP                           BANKMASK(IPR3), 1, a
#define RXCKP                            BANKMASK(BAUDCON1), 5, a
#define RXDTP1                           BANKMASK(BAUDCON1), 5, a
#define RXDTP2                           BANKMASK(BAUDCON2), 5, a
#define R_NOT_W2                         BANKMASK(SSP2STAT), 2, a
#define R_W2                             BANKMASK(SSP2STAT), 2, a
#define R_nW2                            BANKMASK(SSP2STAT), 2, a
#define S2                               BANKMASK(SSP2STAT), 3, a
#define SCK                              BANKMASK(PORTC), 3, a
#define SCK2                             BANKMASK(PORTD), 6, a
#define SCKP                             BANKMASK(BAUDCON1), 4, a
#define SCKP1                            BANKMASK(BAUDCON1), 4, a
#define SCKP2                            BANKMASK(BAUDCON2), 4, a
#define SCL                              BANKMASK(PORTC), 3, a
#define SCL2                             BANKMASK(PORTD), 6, a
#define SCS0                             BANKMASK(OSCCON), 0, a
#define SCS1                             BANKMASK(OSCCON), 1, a
#define SDA                              BANKMASK(PORTC), 4, a
#define SDA2                             BANKMASK(PORTD), 5, a
#define SDI                              BANKMASK(PORTC), 4, a
#define SDI2                             BANKMASK(PORTD), 5, a
#define SDO                              BANKMASK(PORTC), 5, a
#define SDO2                             BANKMASK(PORTD), 4, a
#define SE0                              BANKMASK(UCON), 5, a
#define SEN                              BANKMASK(SSP1CON2), 0, a
#define SEN1                             BANKMASK(SSP1CON2), 0, a
#define SEN2                             BANKMASK(SSP2CON2), 0, a
#define SENDB                            BANKMASK(TXSTA1), 3, a
#define SENDB1                           BANKMASK(TXSTA1), 3, a
#define SENDB2                           BANKMASK(TXSTA2), 3, a
#define SMP                              BANKMASK(SSP1STAT), 7, a
#define SMP1                             BANKMASK(SSP1STAT), 7, a
#define SMP2                             BANKMASK(SSP2STAT), 7, a
#define SOFIE                            BANKMASK(UIE), 6, b
#define SOFIF                            BANKMASK(UIR), 6, a
#define SOSCEN                           BANKMASK(T1CON), 3, a
#define SOSCEN3                          BANKMASK(T3CON), 3, a
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SPEN                             BANKMASK(RCSTA1), 7, a
#define SPEN1                            BANKMASK(RCSTA1), 7, a
#define SPEN2                            BANKMASK(RCSTA2), 7, a
#define SPI1OD                           BANKMASK(ODCON3), 0, a
#define SPI2OD                           BANKMASK(ODCON3), 1, a
#define SREN                             BANKMASK(RCSTA1), 5, a
#define SREN1                            BANKMASK(RCSTA1), 5, a
#define SREN2                            BANKMASK(RCSTA2), 5, a
#define SRENA                            BANKMASK(RCSTA1), 5, a
#define SS                               BANKMASK(PORTF), 7, a
#define SS2                              BANKMASK(PORTD), 7, a
#define SSP1IE                           BANKMASK(PIE1), 3, a
#define SSP1IF                           BANKMASK(PIR1), 3, a
#define SSP1IP                           BANKMASK(IPR1), 3, a
#define SSP2IE                           BANKMASK(PIE3), 7, a
#define SSP2IF                           BANKMASK(PIR3), 7, a
#define SSP2IP                           BANKMASK(IPR3), 7, a
#define SSPEN                            BANKMASK(SSP1CON1), 5, a
#define SSPEN1                           BANKMASK(SSP1CON1), 5, a
#define SSPEN2                           BANKMASK(SSP2CON1), 5, a
#define SSPIE                            BANKMASK(PIE1), 3, a
#define SSPIF                            BANKMASK(PIR1), 3, a
#define SSPIP                            BANKMASK(IPR1), 3, a
#define SSPM0                            BANKMASK(SSP1CON1), 0, a
#define SSPM01                           BANKMASK(SSP1CON1), 0, a
#define SSPM02                           BANKMASK(SSP2CON1), 0, a
#define SSPM1                            BANKMASK(SSP1CON1), 1, a
#define SSPM11                           BANKMASK(SSP1CON1), 1, a
#define SSPM12                           BANKMASK(SSP2CON1), 1, a
#define SSPM2                            BANKMASK(SSP1CON1), 2, a
